; domain
; IPC5 Domain: Storage Propositional
; Authors: Alfonso Gerevini and Alessandro Saetti 

(define (domain Storage)
(:requirements :typing)
(:types hoist surface place area - object
	container depot - place
	storearea transitarea - area
	area crate - surface)

(:predicates (clear ?s - storearea)
	     (in ?x - object ?p - place)
	     (available ?h - hoist) 
	     (lifting ?h - hoist ?c - crate) 
	     (at ?h - hoist ?a - area)
	     (on ?c - crate ?s - storearea) 
	     (connected ?a1 ?a2 - area)) 

(:action lift
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (available ?h) 
		    (on ?c ?a1) (in ?a1 ?p))
 :effect (and (not (on ?c ?a1)) (clear ?a1)
	      (not (available ?h)) (lifting ?h ?c) (not (in ?c ?p))))
				
(:action drop
 :parameters (?h - hoist ?c - crate ?a1 - storearea ?a2 - area ?p - place)
 :precondition (and (connected ?a1 ?a2) (at ?h ?a2) (lifting ?h ?c) 
		    (clear ?a1) (in ?a1 ?p))
 :effect (and (not (lifting ?h ?c)) (available ?h)
	      (not (clear ?a1)) (on ?c ?a1) (in ?c ?p)))

(:action move
 :parameters (?h - hoist ?from ?to - storearea)
 :precondition (and (at ?h ?from) (clear ?to) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to)) (clear ?from)))

(:action go-out
 :parameters (?h - hoist ?from - storearea ?to - transitarea)
 :precondition (and (at ?h ?from) (connected ?from ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (clear ?from)))

(:action go-in
 :parameters (?h - hoist ?from - transitarea ?to - storearea)
 :precondition (and (at ?h ?from) (connected ?from ?to) (clear ?to))
 :effect (and (not (at ?h ?from)) (at ?h ?to) (not (clear ?to))))
)

; problem
; Map of the Depots:                  
; 0000=1111       
; 0*0  11*        
;----------       
; 0: depot0 area
; 1: depot1 area
; *: Depot access point
; =: Transit area

(define (problem storage-17)
(:domain Storage)
(:objects
	depot0-1-1 depot0-1-2 depot0-1-3 depot0-1-4 depot0-2-1 depot0-2-2 depot0-2-3 depot1-1-1 depot1-1-2 depot1-1-3 depot1-1-4 depot1-2-1 depot1-2-2 depot1-2-3 container-0-0 container-0-1 container-0-2 container-0-3 container-1-0 container-1-1 container-1-2 - storearea
	hoist0 hoist1 hoist2 - hoist
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - crate
	container0 container1 - container
	depot0 depot1 - depot
	loadarea transit0 - transitarea)

(:init
	(connected depot0-1-1 depot0-2-1)
	(connected depot0-1-1 depot0-1-2)
	(connected depot0-1-2 depot0-2-2)
	(connected depot0-1-2 depot0-1-3)
	(connected depot0-1-2 depot0-1-1)
	(connected depot0-1-3 depot0-2-3)
	(connected depot0-1-3 depot0-1-4)
	(connected depot0-1-3 depot0-1-2)
	(connected depot0-1-4 depot0-1-3)
	(connected depot0-2-1 depot0-1-1)
	(connected depot0-2-1 depot0-2-2)
	(connected depot0-2-2 depot0-1-2)
	(connected depot0-2-2 depot0-2-3)
	(connected depot0-2-2 depot0-2-1)
	(connected depot0-2-3 depot0-1-3)
	(connected depot0-2-3 depot0-2-2)
	(connected depot1-1-1 depot1-2-1)
	(connected depot1-1-1 depot1-1-2)
	(connected depot1-1-2 depot1-2-2)
	(connected depot1-1-2 depot1-1-3)
	(connected depot1-1-2 depot1-1-1)
	(connected depot1-1-3 depot1-2-3)
	(connected depot1-1-3 depot1-1-4)
	(connected depot1-1-3 depot1-1-2)
	(connected depot1-1-4 depot1-1-3)
	(connected depot1-2-1 depot1-1-1)
	(connected depot1-2-1 depot1-2-2)
	(connected depot1-2-2 depot1-1-2)
	(connected depot1-2-2 depot1-2-3)
	(connected depot1-2-2 depot1-2-1)
	(connected depot1-2-3 depot1-1-3)
	(connected depot1-2-3 depot1-2-2)
	(connected transit0 depot0-1-4)
	(connected transit0 depot1-1-1)
	(in depot0-1-1 depot0)
	(in depot0-1-2 depot0)
	(in depot0-1-3 depot0)
	(in depot0-1-4 depot0)
	(in depot0-2-1 depot0)
	(in depot0-2-2 depot0)
	(in depot0-2-3 depot0)
	(in depot1-1-1 depot1)
	(in depot1-1-2 depot1)
	(in depot1-1-3 depot1)
	(in depot1-1-4 depot1)
	(in depot1-2-1 depot1)
	(in depot1-2-2 depot1)
	(in depot1-2-3 depot1)
	(on crate0 container-0-0)
	(on crate1 container-0-1)
	(on crate2 container-0-2)
	(on crate3 container-0-3)
	(on crate4 container-1-0)
	(on crate5 container-1-1)
	(on crate6 container-1-2)
	(in crate0 container0)
	(in crate1 container0)
	(in crate2 container0)
	(in crate3 container0)
	(in crate4 container1)
	(in crate5 container1)
	(in crate6 container1)
	(in container-0-0 container0)
	(in container-0-1 container0)
	(in container-0-2 container0)
	(in container-0-3 container0)
	(in container-1-0 container1)
	(in container-1-1 container1)
	(in container-1-2 container1)
	(connected loadarea container-0-0) 
	(connected container-0-0 loadarea)
	(connected loadarea container-0-1) 
	(connected container-0-1 loadarea)
	(connected loadarea container-0-2) 
	(connected container-0-2 loadarea)
	(connected loadarea container-0-3) 
	(connected container-0-3 loadarea)
	(connected loadarea container-1-0) 
	(connected container-1-0 loadarea)
	(connected loadarea container-1-1) 
	(connected container-1-1 loadarea)
	(connected loadarea container-1-2) 
	(connected container-1-2 loadarea)  
	(connected depot0-2-2 loadarea)
	(connected loadarea depot0-2-2)
	(connected depot1-2-3 loadarea)
	(connected loadarea depot1-2-3)  
	(clear depot0-2-3)
	(clear depot0-1-2)
	(clear depot0-1-3)
	(clear depot0-1-4)
	(clear depot0-2-1)
	(clear depot0-2-2)
	(clear depot1-1-1)
	(clear depot1-1-2)
	(clear depot1-1-3)
	(clear depot1-1-4)
	(clear depot1-2-2)  
	(at hoist0 depot0-1-1)
	(available hoist0)
	(at hoist1 depot1-2-1)
	(available hoist1)
	(at hoist2 depot1-2-3)
	(available hoist2))

(:goal (and
	(in crate0 depot0)
	(in crate1 depot0)
	(in crate2 depot0)
	(in crate3 depot1)
	(in crate4 depot1)
	(in crate5 depot1)
	(in crate6 depot1)))

(:metric minimize (total-time))
)

; plan
1. (go-out hoist2 depot1-2-3 loadarea)
   deleted: (at hoist2 depot1-2-3)
   added: (at hoist2 loadarea) (clear depot1-2-3)
   goals met: 0 of 7
2. (lift hoist2 crate0 container-0-0 loadarea container0)
   deleted: (on crate0 container-0-0) (available hoist2) (in crate0 container0)
   added: (clear container-0-0) (lifting hoist2 crate0)
   goals met: 0 of 7
3. (go-in hoist2 loadarea depot0-2-2)
   deleted: (at hoist2 loadarea) (clear depot0-2-2)
   added: (at hoist2 depot0-2-2)
   goals met: 0 of 7
4. (drop hoist2 crate0 depot0-2-1 depot0-2-2 depot0)
   deleted: (lifting hoist2 crate0) (clear depot0-2-1)
   added: (available hoist2) (on crate0 depot0-2-1) (in crate0 depot0)
   goals met: 1 of 7
5. (go-out hoist2 depot0-2-2 loadarea)
   deleted: (at hoist2 depot0-2-2)
   added: (at hoist2 loadarea) (clear depot0-2-2)
   goals met: 1 of 7
6. (lift hoist2 crate1 container-0-1 loadarea container0)
   deleted: (on crate1 container-0-1) (available hoist2) (in crate1 container0)
   added: (clear container-0-1) (lifting hoist2 crate1)
   goals met: 1 of 7
7. (go-in hoist2 loadarea depot0-2-2)
   deleted: (at hoist2 loadarea) (clear depot0-2-2)
   added: (at hoist2 depot0-2-2)
   goals met: 1 of 7
8. (drop hoist2 crate1 depot0-2-3 depot0-2-2 depot0)
   deleted: (lifting hoist2 crate1) (clear depot0-2-3)
   added: (available hoist2) (on crate1 depot0-2-3) (in crate1 depot0)
   goals met: 2 of 7
9. (go-out hoist2 depot0-2-2 loadarea)
   deleted: (at hoist2 depot0-2-2)
   added: (at hoist2 loadarea) (clear depot0-2-2)
   goals met: 2 of 7
10. (lift hoist2 crate2 container-0-2 loadarea container0)
   deleted: (on crate2 container-0-2) (available hoist2) (in crate2 container0)
   added: (clear container-0-2) (lifting hoist2 crate2)
   goals met: 2 of 7
11. (drop hoist2 crate2 depot0-2-2 loadarea depot0)
   deleted: (lifting hoist2 crate2) (clear depot0-2-2)
   added: (available hoist2) (on crate2 depot0-2-2) (in crate2 depot0)
   goals met: 3 of 7
12. (lift hoist2 crate3 container-0-3 loadarea container0)
   deleted: (on crate3 container-0-3) (available hoist2) (in crate3 container0)
   added: (clear container-0-3) (lifting hoist2 crate3)
   goals met: 3 of 7
13. (go-in hoist2 loadarea depot1-2-3)
   deleted: (at hoist2 loadarea) (clear depot1-2-3)
   added: (at hoist2 depot1-2-3)
   goals met: 3 of 7
14. (drop hoist2 crate3 depot1-1-3 depot1-2-3 depot1)
   deleted: (lifting hoist2 crate3) (clear depot1-1-3)
   added: (available hoist2) (on crate3 depot1-1-3) (in crate3 depot1)
   goals met: 4 of 7
15. (go-out hoist2 depot1-2-3 loadarea)
   deleted: (at hoist2 depot1-2-3)
   added: (at hoist2 loadarea) (clear depot1-2-3)
   goals met: 4 of 7
16. (lift hoist2 crate4 container-1-0 loadarea container1)
   deleted: (on crate4 container-1-0) (available hoist2) (in crate4 container1)
   added: (clear container-1-0) (lifting hoist2 crate4)
   goals met: 4 of 7
17. (drop hoist2 crate4 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist2 crate4) (clear depot1-2-3)
   added: (available hoist2) (on crate4 depot1-2-3) (in crate4 depot1)
   goals met: 5 of 7
18. (move hoist1 depot1-2-1 depot1-2-2)
   deleted: (at hoist1 depot1-2-1) (clear depot1-2-2)
   added: (at hoist1 depot1-2-2) (clear depot1-2-1)
   goals met: 5 of 7
19. (lift hoist1 crate4 depot1-2-3 depot1-2-2 depot1)
   deleted: (on crate4 depot1-2-3) (available hoist1) (in crate4 depot1)
   added: (clear depot1-2-3) (lifting hoist1 crate4)
   goals met: 4 of 7
20. (drop hoist1 crate4 depot1-1-2 depot1-2-2 depot1)
   deleted: (lifting hoist1 crate4) (clear depot1-1-2)
   added: (available hoist1) (on crate4 depot1-1-2) (in crate4 depot1)
   goals met: 5 of 7
21. (lift hoist2 crate5 container-1-1 loadarea container1)
   deleted: (on crate5 container-1-1) (available hoist2) (in crate5 container1)
   added: (clear container-1-1) (lifting hoist2 crate5)
   goals met: 5 of 7
22. (drop hoist2 crate5 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist2 crate5) (clear depot1-2-3)
   added: (available hoist2) (on crate5 depot1-2-3) (in crate5 depot1)
   goals met: 6 of 7
23. (lift hoist2 crate6 container-1-2 loadarea container1)
   deleted: (on crate6 container-1-2) (available hoist2) (in crate6 container1)
   added: (clear container-1-2) (lifting hoist2 crate6)
   goals met: 6 of 7
24. (lift hoist1 crate5 depot1-2-3 depot1-2-2 depot1)
   deleted: (on crate5 depot1-2-3) (available hoist1) (in crate5 depot1)
   added: (clear depot1-2-3) (lifting hoist1 crate5)
   goals met: 5 of 7
25. (drop hoist1 crate5 depot1-2-1 depot1-2-2 depot1)
   deleted: (lifting hoist1 crate5) (clear depot1-2-1)
   added: (available hoist1) (on crate5 depot1-2-1) (in crate5 depot1)
   goals met: 6 of 7
26. (drop hoist2 crate6 depot1-2-3 loadarea depot1)
   deleted: (lifting hoist2 crate6) (clear depot1-2-3)
   added: (available hoist2) (on crate6 depot1-2-3) (in crate6 depot1)
   goals met: 7 of 7
